package com.example.lab5

import java.util.UUID

object NoteData {
    val notes = arrayListOf(
        Note(
            id = UUID.randomUUID().toString(),
            title = "Створити Notes App",
            shortDescription = "(Додаток заміток) з використанням фрагментів, який дозволяє користувачам створювати та переглядати замітки. Перший фрагмент - це форма, де користувач може створювати нові замітки, вводячи заголовок та текст замітки. При натисканні на кнопку \"Зберегти\", нова замітка повинна зберігатись та переходити до списку заміток. Другий фрагмент - цей фрагмент відображає список всіх заміток, які були створені. Кожен елемент списку має відображати заголовок замітки та частину тексту (наприклад, перших 50 символів). Третій фрагмент – це відображення детальної інформації про замітку після натискання на елемент списку. Додайте можливість редагування та видалення заміток з фрагменту. Зберігайте замітки в колекції. Забезпечте підтримку макетів розміток для смартфона і планшета.",

        ),
        Note(
            id = UUID.randomUUID().toString(),
            title = "Покупки",
            shortDescription = "Сьогодні потрібно придбати продукти для вечері: картоплю, моркву, м’ясо, зелень, а також соки та солодощі для гостей."
        ),
        Note(
            id = UUID.randomUUID().toString(),
            title = "Завдання на роботу",
            shortDescription = "Завершити презентацію до проекту, оновити звітність за тиждень, перевірити пошту, відповісти на листи та провести зустріч о 15:00."
        ),
        Note(
            id = UUID.randomUUID().toString(),
            title = "Книга для читання",
            shortDescription = "Почати читати книгу, яку рекомендував друг – \"Сила підсвідомості\" Джозефа Мерфі. Мета: по 20 сторінок щодня."
        ),
        Note(
            id = UUID.randomUUID().toString(),
            title = "План на вихідні",
            shortDescription = "Відвідати парк з родиною, приготувати домашній обід, подивитися новий фільм та зайнятися невеликим прибиранням вдома."
        ),
        Note(
            id = UUID.randomUUID().toString(),
            title = "Здоров'я",
            shortDescription = "Записатись на профілактичний огляд до лікаря, пити більше води щодня, додати до розкладу регулярні прогулянки на свіжому повітрі."
        )


    )
}